class UniversityRequirement {
  List universityRequirementsCourses = [
    [' متطلب جامعة _ اللغة العربية', '2', null, null],
    [' متطلب جامعة _ اللغة الانجليزية', '2', null, null],
    [' متطلب جامعة _ الابتكار وريادة الأعمال', '2', null, null],
    [' متطلب جامعة _ حقوق الإنسان', '2', null, null],
    [' متطلب جامعة _ مبادئ علم الفلسفة', '2', null, null],
    [' متطلب جامعة _ الأنسان و البيئة', '2', null, null],
    [' متطلب جامعة _ أساسيات الادارة', '2', null, null],
    [' متطلب جامعة _ المحاسبة', '2', null, null],
    [' متطلب جامعة _ مبادئ الصحة العامة', '2', null, null],
    [' متطلب جامعة _ مقدمة فى علم الأثار', '2', null, null],
    [' متطلب جامعة _ أخلاقيات المهنة', '2', null, null],
    [' متطلب جامعة _ ادارة الذات', '2', null, null],
    [' متطلب جامعة _ مبادئ علم النفس', '2', null, null],
    [' متطلب جامعة _ تصميم وفنون جميلة', '2', null, null],
    [' متطلب جامعة _ مدخل القانون', '2', null, null],
    [' متطلب جامعة _ تاريخ علوم', '2', null, null],
  ];
  List mandatoryUniversityRequirements = [
    [' متطلب جامعة _ حقوق الإنسان', '2', null, null],
    [' متطلب جامعة _ اللغة العربية', '2', null, null],
    [' متطلب جامعة _ اللغة الانجليزية', '2', null, null],
    [' متطلب جامعة _ الابتكار وريادة الأعمال', '2', null, null],
  ];
}
