class UniversityRequirement {
  static List universityRequirementsCourses = [
    [' متطلب جامعة _ اللغة العربية', '2'],
    [' متطلب جامعة _ اللغة الانجليزية', '2'],
    [' متطلب جامعة _ الابتكار وريادة الأعمال', '2'],
    [' متطلب جامعة _ حقوق الإنسان', '2'],
    [' متطلب جامعة _ مبادئ علم الفلسفة', '2'],
    [' متطلب جامعة _ الأنسان و البيئة', '2'],
    [' متطلب جامعة _ أساسيات الادارة', '2'],
    [' متطلب جامعة _ المحاسبة', '2'],
    [' متطلب جامعة _ مبادئ الصحة العامة', '2'],
    [' متطلب جامعة _ مقدمة فى علم الأثار', '2'],
    [' متطلب جامعة _ أخلاقيات المهنة', '2'],
    [' متطلب جامعة _ ادارة الذات', '2'],
    [' متطلب جامعة _ مبادئ علم النفس', '2'],
    [' متطلب جامعة _ تصميم وفنون جميلة', '2'],
    [' متطلب جامعة _ مدخل القانون', '2'],
    [' متطلب جامعة _ تاريخ علوم', '2'],
  ];
  static List mandatoryUniversityRequirements = [
    [' متطلب جامعة _ اللغة العربية', '2'],
    [' متطلب جامعة _ اللغة الانجليزية', '2'],
    [' متطلب جامعة _ الابتكار وريادة الأعمال', '2'],
    [' متطلب جامعة _ حقوق الإنسان', '2'],
  ];
}
