class UniversityRequirement {
  List universityRequirementsCourses = [
    [
      ' متطلب جامعة _ اللغة العربية',
      '2',
      null,
      null,
      'اللغة العربية',
      'University'
    ],
    [
      ' متطلب جامعة _ اللغة الانجليزية',
      '2',
      null,
      null,
      'اللغة الانجليزية',
      'University'
    ],
    [
      ' متطلب جامعة _ الابتكار وريادة الأعمال',
      '2',
      null,
      null,
      'الابتكار وريادة الأعمال',
      'University'
    ],
    [
      ' متطلب جامعة _ حقوق الإنسان',
      '2',
      null,
      null,
      'حقوق الإنسان',
      'University'
    ],
    [
      ' متطلب جامعة _ مبادئ علم الفلسفة',
      '2',
      null,
      null,
      'مبادئ علم الفلسفة',
      'University'
    ],
    [
      ' متطلب جامعة _ الأنسان و البيئة',
      '2',
      null,
      null,
      'الأنسان و البيئة',
      'University'
    ],
    [
      ' متطلب جامعة _ أساسيات الادارة',
      '2',
      null,
      null,
      'أساسيات الادارة',
      'University'
    ],
    [' متطلب جامعة _ المحاسبة', '2', null, null, 'المحاسبة', 'University'],
    [
      ' متطلب جامعة _ مبادئ الصحة العامة',
      '2',
      null,
      null,
      'مبادئ الصحة العامة',
      'University'
    ],
    [
      ' متطلب جامعة _ مقدمة فى علم الأثار',
      '2',
      null,
      null,
      'مقدمة فى علم الأثار',
      'University'
    ],
    [
      ' متطلب جامعة _ أخلاقيات المهنة',
      '2',
      null,
      null,
      'أخلاقيات المهنة',
      'University'
    ],
    [
      ' متطلب جامعة _ ادارة الذات',
      '2',
      null,
      null,
      'ادارة الذات',
      'University'
    ],
    [
      ' متطلب جامعة _ مبادئ علم النفس',
      '2',
      null,
      null,
      'مبادئ علم النفس',
      'University'
    ],
    [
      ' متطلب جامعة _ تصميم وفنون جميلة',
      '2',
      null,
      null,
      'تصميم وفنون جميلة',
      'University'
    ],
    [
      ' متطلب جامعة _ مدخل القانون',
      '2',
      null,
      null,
      'مدخل القانون',
      'University'
    ],
    [' متطلب جامعة _ تاريخ علوم', '2', null, null, 'تاريخ علوم', 'University'],
  ];
  List mandatoryUniversityRequirements = [
    [
      ' متطلب جامعة _ حقوق الإنسان',
      '2',
      null,
      null,
      'حقوق الإنسان',
      'University'
    ],
    [
      ' متطلب جامعة _ اللغة العربية',
      '2',
      null,
      null,
      'اللغة العربية',
      'University'
    ],
    [
      ' متطلب جامعة _ اللغة الانجليزية',
      '2',
      null,
      null,
      'اللغة الانجليزية',
      'University'
    ],
    [
      ' متطلب جامعة _ الابتكار وريادة الأعمال',
      '2',
      null,
      null,
      'الابتكار وريادة الأعمال',
      'University'
    ],
  ];
}
